function init() {
    /*
        Что же такое ООП?
        ● Объектно-ориентированное программирование - это парадигма
          программирования, основанного на концепции объектов.

        ● Объектами мы описываем реальные модели из жизни.

        ● Мы складываем все данные об объекте и его поведении внутрь.

        ● Из них мы строим приложения, позволяя им взаимодействовать между собой.

        ● ООП если вы пишете видеоигры "гонки" вы можете воспользоваться технологий ООП
          и запрограммировать объект "машины", а затем создать множество таких объектов
          обладающих одинаковым набором свойств и одинаковый функциональностью

        Для чего?
        ● ООП - разрабатывалось, как решение проблемы структурирования приложения.
        ● Благодаря ему, код становится более поддерживаемый, читаемый и структурированный.

        Принципы ООП
        ● Абстракция
            Выделение в моделируемом предмете важного для решения конкретной задачи по предмету,
            скрывая несущественные детали

        ● Инкапсуляция.
            Инкапсуляция обеспечиваем возможность приватных методов или свойства в классе,
            которые не были бы доступны извне.

        ● Наследование.
            Наследование позволяет наследовать данные и функциональность другого класса.
            Это позволяет переиспользовать логику между классами.

        ● Полиморфизм.
            Полиморфизм позволяет использовать объекты с одинаковым "интерфейсом" без
            информации о типе и внутренней структуре объекта.
    */


}
export default init;